---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.AnalyticalModelBaseAlignmentMethod
source: html/3b4352ce-a453-421c-1a3f-e8834620a9da.htm
---
# Autodesk.Revit.DB.ParameterTypeId.AnalyticalModelBaseAlignmentMethod Property

"Base Alignment Method"

## Syntax (C#)
```csharp
public static ForgeTypeId AnalyticalModelBaseAlignmentMethod { get; }
```